pages/resurse/resurse.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-24 Sun 12:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Resurse</title>
<meta name="author" content="Babin Ion" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../imagine.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Resurse</h1>

<div id="outline-container-orgaa6282e" class="outline-2">
<h2 id="orgaa6282e">Resursele din care eu învăț</h2>
<div class="outline-text-2" id="text-orgaa6282e">
<p>
Când vine vorba de învățare, eu sunt genul de persoană care a) ușor se plictisește și b) preferă cărțile cursurilor video. De asta eu învăț din mai multe cărți și resurse deodată. M-am plictisit de una? Învăț din alta.
</p>
</div>

<div id="outline-container-org9b8fe20" class="outline-3">
<h3 id="org9b8fe20">Programare</h3>
<div class="outline-text-3" id="text-org9b8fe20">
</div>
<div id="outline-container-org805d54d" class="outline-4">
<h4 id="org805d54d">Colegiu</h4>
<div class="outline-text-4" id="text-org805d54d">
<p>
Pentru Java am cărțile <i>Think Java</i>, <i>Core Java</i>, <i>Effective Java</i>, <i>OCA Java SE8</i>, <i>Modern Java In Action</i>, și <i>Design Patterns (Gang of Four)</i>. Cu toate acestea, eu cred că cel mai bine înveți atunci când lucrezi la un proiect, cu minimul de cunoștințe. De aceea, nu citesc cărțile cap-coadă, ci le folosesc ca referințe pentru a-mi adânci cunoștințele obținute de pe stackoverflow și indienii youtube-ului.
</p>
</div>
</div>

<div id="outline-container-org21c7780" class="outline-4">
<h4 id="org21c7780">Restul</h4>
<div class="outline-text-4" id="text-org21c7780">
<p>
În timpul liber, învăț din 3 resure principale: <a href="https://teachyourselfcs.com/">Teach Yourself Computer Science</a>, <a href="https://github.com/ossu/computer-science">OSSU</a> și <a href="https://functionalcs.github.io/curriculum/">functionalcs</a>. Care e cea mai bună dintre ele - nu pot spune. Toate 3 sunt structurate ca o curiculă, de aceea calitatea lor depinde în mare parte de resursele pe care fiecare le recomandă.
</p>

<p>
La momentul scrierii, învăț din <a href="https://web.mit.edu/6.001/6.037/sicp.pdf">SICP</a>. Pot să spun că ea &ldquo;rupe mozgu&rdquo; destul de bine, de asta eu încerc să o evit pe cât posibil, prin cursul <a href="https://www.coursera.org/learn/programming-languages">acesta</a>. Din <i>functionalcs</i> citesc doar câteva cărți (cele de OCaml și SML), dar nu citec tot, ci doar lucrurile pe care nu le știu (evident, sunt multe lucruri care se repetă în 3 curicule).
</p>
</div>
</div>
</div>

<div id="outline-container-orgc587b2e" class="outline-3">
<h3 id="orgc587b2e">Matematică</h3>
<div class="outline-text-3" id="text-orgc587b2e">
<p>
Aici am o grămadă de cărți. La momentul actual, învăț din <i>Basic Mathematics</i> de Serge Lang și <i>Algebra</i> de Gelfand. Ambele sunt cărți cu exerciții neobișnuite la care trebuie să te gândești. Ambele încep de la lucruri elementare, îți dau minimul de cunoștințe, și te pun să le aplici pe exerciții care necesită gândire. <i>Basic Mathematics</i> include geometrie și trigonometrie, explicate, la fel, foarte succint. Nu necesită absolut nici o cunoștință matematică (poate doar tabla înmulțirii și să numeri până la 100).
</p>

<p>
Cel care a creat <i>functionalcs</i> are și un <i>fel de două feluri</i> pentru <a href="https://learnaifromscratch.github.io/math.html">matematică</a>. Cartea pe care el o recomandă, însă, e mult prea jostkaia pentru mine. YMMV.
</p>

<p>
<a href="../../index.html">Înapoi</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Babin Ion</p>
<p class="date">Created: 2022-04-24 Sun 12:56</p>
</div>
</body>
</html>
